simulations/run003/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../input"

convertToMeters 1;

vertices
(
    (0 0 0)
    (0.10 0 0)
    (0.10 1 0)
    (0 1 0)
    (0 0 0.02)
    (0.10 0 0.02)
    (0.10 1 0.02)
    (0 1 0.02)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($nx $ny $nz) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    outlet
    {
    	type patch;
		faces
		(
		    (3 7 6 2)
		);
	}
    walls
    {
    	type wall;
		faces
		(
		    (1 5 4 0)
		    (0 1 2 3)
		    (4 5 6 7)
		    (0 4 7 3)
		    (2 6 5 1)
		);
	}
);

mergePatchPairs
(
);

// ************************************************************************* //
